# Brewfile — managed by chezmoi
# Source of truth for intended Homebrew state.
# - This file is evaluated as Ruby; use OS.mac? / OS.linux? for platform-specific entries.
# - Do NOT regenerate this file wholesale from `brew bundle dump`.
#   Comments, conditionals, and annotations are hand-maintained.
# - Commented-out lines are intentionally excluded (broken, unwanted, or deferred).

# brew "age-plugin-yubikey"
brew "antidote" # zsh plugin manager
brew "asitop" if OS.mac? # apple silicon top
brew "aws-vault"
brew "awscli"
brew "bash"
brew "bat" # better cat
brew "blueutil" if OS.mac?
brew "btop"
brew "cbonsai"
brew "chezmoi"
brew "colima"
brew "colordiff"
brew "docker"
brew "docker-compose"
brew "eza" # better ls
brew "fd" # nvim mason dep
brew "fzf" # fuzzy finder
brew "gh" # github cli
brew "git"
# brew "gmp"
# brew "gnupg"
brew "htop"
brew "kubernetes-cli"
# brew "libyaml"
brew "mas" if OS.mac? # mac app store
brew "mise" # mise-en-place
brew "neovim"
brew "opencode"
brew "parallel"
# brew "pinentry-mac" if OS.mac?
# brew "rage" # better age
brew "ripgrep"
brew "sevenzip"
brew "thefuck"
brew "tmux"
brew "uv" # python manager
brew "wakatime-cli"
brew "wget"
# brew "ykman"
# brew "ykpers"
brew "zsh"
cask "1password" if OS.mac? # work
cask "1password-cli" if OS.mac? # work
cask "alfred" if OS.mac? # better spotlight
cask "amethyst" if OS.mac? # tiling wm
cask "cursor" if OS.mac?
# cask "element" if OS.mac? # matrix chat
cask "eqmac" if OS.mac?
cask "finicky" if OS.mac?
cask "font-fira-code-nerd-font" if OS.mac?
cask "gcloud-cli" if OS.mac?
# cask "google-drive" if OS.mac?
# cask "gpg-suite" if OS.mac?
cask "iterm2" if OS.mac? # better terminal
cask "jordanbaird-ice" if OS.mac? # menu bar
# cask "lm-studio" if OS.mac?
cask "lookaway" if OS.mac? # screen breaks
cask "lulu" if OS.mac? # firewall
# cask "macwhisper" if OS.mac?
cask "obsidian" if OS.mac?
cask "openlens" if OS.mac?
cask "shadow" if OS.mac?
# cask "slack" if OS.mac?
cask "visual-studio-code" if OS.mac?
cask "wakatime" if OS.mac?
cask "xscreensaver" if OS.mac?
# cask "yubico-authenticator" if OS.mac?
cask "zed" if OS.mac?
# cask "zoom" if OS.mac?
mas "Fantastical", id: 975937182 if OS.mac?
mas "Irvue", id: 1039633667 if OS.mac?
